//-----------------------------------------------------------------------------
// @brief  障害物：浮遊する.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------
#include "ObstructFloat.h"

#define _USE_MATH_DEFINES
#include <math.h>

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
ObstructFloat::ObstructFloat(int sourceModelHandle)
	: ObstructBase(sourceModelHandle)
{
	pos = VGet(0, 0, 0);
	rad = 0;
	hitRadius = 5.0f;
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
ObstructFloat::~ObstructFloat()
{
	// 処理なし.
}

//-----------------------------------------------------------------------------
// @brief  更新.
//-----------------------------------------------------------------------------
void ObstructFloat::Update()
{
	rad += static_cast<float>((M_PI / 180) * 5);

	pos.y = 1.0f + sinf(rad);

	// ３Dモデルのポジション設定
	MV1SetPosition(modelHandle, pos);
}
