//-----------------------------------------------------------------------------
// @brief  ３次元ベクトル.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------
#include "Vector.h"

//-----------------------------------------------------------------------------
// @brief  ３次元ベクトルv1とv2の加算結果を返す.
//-----------------------------------------------------------------------------
Vector3 Vector3Add(const Vector3& v1, const Vector3& v2)
{
	Vector3 ret;
	ret.x = v1.x + v2.x;
	ret.y = v1.y + v2.y;
	ret.z = v1.z + v2.z;
	return ret;
}

//-----------------------------------------------------------------------------
// @brief  ３次元ベクトルv1とv2の減算結果を返す.
//-----------------------------------------------------------------------------
Vector3 Vector3Sub(const Vector3& v1, const Vector3& v2)
{
	Vector3 ret;
	ret.x = v1.x - v2.x;
	ret.y = v1.y - v2.y;
	ret.z = v1.z - v2.z;
	return ret;
}

//-----------------------------------------------------------------------------
// @brief  ３次元ベクトルvとfloat値scaleのスカラー積の結果を返す.
//-----------------------------------------------------------------------------
Vector3 Vector3Scale(const Vector3& v, float scale)
{
	Vector3 ret;
	ret.x = v.x * scale;
	ret.y = v.y * scale;
	ret.z = v.z * scale;
	return ret;
}