//-----------------------------------------------------------------------------
// @brief  テクスチャクラス.
// Copyright (c) 2017 VikingMaxx Takeru Yui. All rights reserved.
//-----------------------------------------------------------------------------

#include "vmlib.h"
#include "VMTexture.h"

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
VMTexture::~VMTexture()
{
    Unload();
}

//-----------------------------------------------------------------------------
// @brief  ロード.
//-----------------------------------------------------------------------------
void VMTexture::Load(const LPCSTR path)
{
    // テクスチャのロード.
    if (D3DXCreateTextureFromFile(GetDxDevice(), path, &texture))
    {
        LogWarn("textureの作成に失敗しました。path:%s\n", path);
    }
}

//-----------------------------------------------------------------------------
// @brief  アンロード.
//-----------------------------------------------------------------------------
void VMTexture::Unload()
{
    if (texture)
    {
        texture->Release();
        texture = NULL;
    }
}
