//-----------------------------------------------------------------------------
// @brief  三角形表示のチュートリアル.
// Copyright (c) 2016 Takeru Yui.
//-----------------------------------------------------------------------------

#include "vmlib.h"
#include "Game.h"

//-----------------------------------------------------------------------------
// グローバル変数群.
//-----------------------------------------------------------------------------
Game* g_game = NULL;

//-----------------------------------------------------------------------------
// @brief  アプリケーションのエントリーポイント
//-----------------------------------------------------------------------------
INT WINAPI wWinMain(HINSTANCE hInst, HINSTANCE, LPWSTR, INT)
{
    // VMライブラリ初期化.
    if (VMLib_Init())
    {
        // ゲームクラス初期化.
        g_game = new Game();
        g_game->Initialize();

        while (ProcessMessage() != 0)
        {
            // 更新.
            g_game->Update();

            // 描画.
            g_game->Render();
        }

        // グローバル変数群の解放.
        if (g_game != NULL)
        {
            g_game->Finalize();
            delete g_game;
            g_game = NULL;
        }
    }
    VMLib_End();

    return 0;
}
